pebble/qemu/hw/stm32_rcc_configs.c
#include "stm32_rcc_configs.h"

const struct Stm32RccConfig STM32F1_RCC_CONFIG = {
    .HSI_FREQ = 8000000,
    .LSI_FREQ = 40000,

    .RCC_CR_OFFSET = 0X00,
    .RCC_CR_PLL3RDY_CL_BIT   = 29,
    .RCC_CR_PLL3ON_CL_BIT    = 28,
    .RCC_CR_PLL2RDY_CL_BIT   = 27,
    .RCC_CR_PLL2ON_CL_BIT    = 26,
    .RCC_CR_PLLRDY_BIT       = 25,
    .RCC_CR_PLLON_BIT        = 24,
    .RCC_CR_CSSON_BIT        = 19,
    .RCC_CR_HSEBYP_BIT       = 18,
    .RCC_CR_HSERDY_BIT       = 17,
    .RCC_CR_HSEON_BIT        = 16,
    .RCC_CR_HSICAL_START     = 8,
    .RCC_CR_HSICAL_MASK      = 0X0000FF00,
    .RCC_CR_HSITRIM_START    = 3,
    .RCC_CR_HSITRIM_MASK     = 0X000000F8,
    .RCC_CR_HSIRDY_BIT       = 1,
    .RCC_CR_HSION_BIT        = 0,

    .RCC_CFGR_OFFSET = 0X04,
    .RCC_CFGR_MCO_START       = 24,
    .RCC_CFGR_MCO_MASK        = 0X07000000,
    .RCC_CFGR_MCO_CL_MASK     = 0X0F000000,
    .RCC_CFGR_USBPRE_BIT      = 22,
    .RCC_CFGR_OTGFSPRE_CL_BIT = 22,
    .RCC_CFGR_PLLMUL_START    = 18,
    .RCC_CFGR_PLLMUL_MASK     = 0X003C0000,
    .RCC_CFGR_PLLXTPRE_BIT    = 17,
    .RCC_CFGR_PLLSRC_BIT      = 16,
    .RCC_CFGR_ADCPRE_START    = 14,
    .RCC_CFGR_ADCPRE_MASK     = 0X0000C000,
    .RCC_CFGR_PPRE2_START     = 11,
    .RCC_CFGR_PPRE2_MASK      = 0X00003C00,
    .RCC_CFGR_PPRE1_START     = 8,
    .RCC_CFGR_PPRE1_MASK      = 0X00000700,
    .RCC_CFGR_HPRE_START      = 4,
    .RCC_CFGR_HPRE_MASK       = 0X000000F0,
    .RCC_CFGR_SWS_START       = 2,
    .RCC_CFGR_SWS_MASK        = 0X0000000C,
    .RCC_CFGR_SW_START        = 0,
    .RCC_CFGR_SW_MASK         = 0X00000003,

    .RCC_CIR_OFFSET = 0X08,

    .RCC_APB2RSTR_OFFSET = 0X0C,

    .RCC_APB1RSTR_OFFSET = 0X10,

    .RCC_AHBENR_OFFSET = 0X14,

    .RCC_APB2ENR_OFFSET = 0X18,
    .RCC_APB2ENR_ADC3EN_BIT   = 15,
    .RCC_APB2ENR_USART1EN_BIT = 14,
    .RCC_APB2ENR_TIM8EN_BIT   = 13,
    .RCC_APB2ENR_SPI1EN_BIT   = 12,
    .RCC_APB2ENR_TIM1EN_BIT   = 11,
    .RCC_APB2ENR_ADC2EN_BIT   = 10,
    .RCC_APB2ENR_ADC1EN_BIT   = 9,
    .RCC_APB2ENR_IOPGEN_BIT   = 8,
    .RCC_APB2ENR_IOPFEN_BIT   = 7,
    .RCC_APB2ENR_IOPEEN_BIT   = 6,
    .RCC_APB2ENR_IOPDEN_BIT   = 5,
    .RCC_APB2ENR_IOPCEN_BIT   = 4,
    .RCC_APB2ENR_IOPBEN_BIT   = 3,
    .RCC_APB2ENR_IOPAEN_BIT   = 2,
    .RCC_APB2ENR_AFIOEN_BIT   = 0,

    .RCC_APB1ENR_OFFSET = 0X1C,
    .RCC_APB1ENR_DACEN_BIT    = 29,
    .RCC_APB1ENR_PWREN_BIT    = 28,
    .RCC_APB1ENR_BKPEN_BIT    = 27,
    .RCC_APB1ENR_CAN2EN_BIT   = 26,
    .RCC_APB1ENR_CAN1EN_BIT   = 25,
    .RCC_APB1ENR_CANEN_BIT    = 25,
    .RCC_APB1ENR_USBEN_BIT    = 23,
    .RCC_APB1ENR_I2C2EN_BIT   = 22,
    .RCC_APB1ENR_I2C1EN_BIT   = 21,
    .RCC_APB1ENR_USART5EN_BIT = 20,
    .RCC_APB1ENR_USART4EN_BIT = 19,
    .RCC_APB1ENR_USART3EN_BIT = 18,
    .RCC_APB1ENR_USART2EN_BIT = 17,
    .RCC_APB1ENR_SPI3EN_BIT   = 15,
    .RCC_APB1ENR_SPI2EN_BIT   = 14,
    .RCC_APB1ENR_WWDGEN_BIT   = 11,
    .RCC_APB1ENR_TIM7EN_BIT   = 5,
    .RCC_APB1ENR_TIM6EN_BIT   = 4,
    .RCC_APB1ENR_TIM5EN_BIT   = 3,
    .RCC_APB1ENR_TIM4EN_BIT   = 2,
    .RCC_APB1ENR_TIM3EN_BIT   = 1,
    .RCC_APB1ENR_TIM2EN_BIT   = 0,

    .RCC_BDCR_OFFSET = 0X20,
    .RCC_BDCR_RTCEN_BIT = 15,
    .RCC_BDCR_RTCSEL_START = 8,
    .RCC_BDCR_RTCSEL_MASK = 0X00000300,
    .RCC_BDCR_LSERDY_BIT = 1,
    .RCC_BDCR_LSEON_BIT = 0,

    .RCC_CSR_OFFSET = 0X24,
    .RCC_CSR_LSIRDY_BIT = 1,
    .RCC_CSR_LSION_BIT = 0,

    .RCC_AHBRSTR = 0X28,

    .RCC_CFGR2_OFFSET = 0X2C,
    .RCC_CFGR2_I2S3SRC_BIT    = 18,
    .RCC_CFGR2_I2S2SRC_BIT    = 17,
    .RCC_CFGR2_PREDIV1SRC_BIT = 16,
    .RCC_CFGR2_PLL3MUL_START  = 12,
    .RCC_CFGR2_PLL3MUL_MASK   = 0X0000F000,
    .RCC_CFGR2_PLL2MUL_START  = 8,
    .RCC_CFGR2_PLL2MUL_MASK   = 0X00000F00,
    .RCC_CFGR2_PREDIV2_START  = 4,
    .RCC_CFGR2_PREDIV2_MASK   = 0X000000F0,
    .RCC_CFGR2_PREDIV_START   = 0,
    .RCC_CFGR2_PREDIV_MASK    = 0X0000000F,
    .RCC_CFGR2_PLLXTPRE_BIT   = 0,

    .PLLSRC_HSI_SELECTED = 0,
    .PLLSRC_HSE_SELECTED = 1,

    .SW_HSI_SELECTED = 0,
    .SW_HSE_SELECTED = 1,
    .SW_PLL_SELECTED = 2,
};

